In [32]:
import pandas as pd
testData = pd.read_csv("./data/startdata.csv",sep = ';', index_col = ['Date and time'], parse_dates = ['Date and time'], dayfirst = True)

raw_data = {'Value4': [1,2,3,4,5,6],
            'Value3': ['A', 'B', 'C', 'D', 'E', 'F'],
            'Value2': [100, 200, 300, 400, 500, 600],
            'Value1': [1000, 2000, 3000, 4000, 5000, 6000]}

df = pd.DataFrame(raw_data, columns = ['Value4','Value3', 'Value2', 'Value1'])
df = df.set_index(['Value4', 'Value3'])

x = testData.groupby('Value3').mean()

x.add(df)

               Value  Value1   Value2
Value4 Value3
1      A         NaN     NaN  143.000
2      B         NaN     NaN  241.625
3      C         NaN     NaN  334.750
4      D         NaN     NaN  458.625
5      E         NaN     NaN  539.000
6      F         NaN     NaN  644.875